Repository: tramanh1511/ThangLongAR
Catalog: lib/l10n/app_*.arb
Languages: vi

# welcomeTitle
source: Thang Long AR
vi: Thăng Long AR

# welcomeContent
source: Decoding the Imperial Citadel of Thang Long Immerse yourself in historical moments
vi: Giải mã Hoàng Thành Thăng Long Đắm chìm trong những khoảnh khắc lịch sử

# welcomeButton
source: Get started
vi: Bắt đầu

source: Home
vi: Trang chủ

source: Destinations
vi: Di tích

source: Map
vi: Trưng bày

source: Settings
vi: Cài đặt

source: Search
vi: Tìm kiếm di tích

# introTitle
source: Introduction
vi: Giới thiệu

# introContent
source: The Imperial Citadel of Thang Long is a massive architectural complex built by successive dynasties throughout history and has become one of the most important relics in the system of Vietnam's relics.'
vi: Hoàng thành Thăng Long là một quần thể kiến trúc khổng lồ được xây dựng bởi các triều đại liên tiếp suốt lịch sử và đã trở thành một trong những di tích quan trọng nhất trong hệ thống di tích của Việt Nam.

# tourTitle
source: Visiting Tour
vi: Chuyến tham quan

# tourContent
source: Visiting time and ticket prices as well as information that tourists need to know when visiting Thang Long Citadel.
vi: Thời gian tham quan, giá vé cũng như thông tin mà du khách cần biết khi tham quan Hoàng Thành Thăng Long.

# newsTitle
source: News
vi: Tin tức

# newsContent
source: Daily news about the Imperial Citadel of Thang Long.
vi: Tin tức hàng ngày về Hoàng thành Thăng Long.

# address
source: Address: No. 19C Hoang Dieu, Ba Dinh, Hanoi
vi: Địa chỉ: Số 19C Hoàng Diệu, Ba Đình, Hà Nội

# phone
source: Phone: (+84) 0347567890
vi: Điện thoại: (+84) 0347567890

source: Detail
vi: Chi tiết

# intro1
source: The Imperial Citadel of Thang Long is a complex of relics associated with the history of Imperial Citadel of Thang Long of Hanoi. This massive architectural work was built by successive dynasties over many historical periods and has become one of the most important relics in the system of Vietnamese relics.
vi: Hoàng thành Thăng Long là quần thể di tích gắn với lịch sử kinh thành Thăng Long Hà Nội. Công trình kiến trức đồ sộ này được các triều vua xây dựng trong nhiều giai đoạn lịch sử và trở thành di tích quan trọng bậc nhất trong hệ thống các di tích Việt Nam

# intro2
source: In December 2002, experts conducted excavations on a total area of 19,000m2 in the Ba Dinh political center - Hanoi. This largest archaeological excavation in Vietnam and Southeast Asia has unearthed traces of Imperial Citadel of Thang Long in the course of its 13-century history with overlapping relics and cultural layers.
vi: Tháng 12/2002, các chuyên gia đã tiến hành khai quật trên tổng diện tích 19.000m2 tại trung tâm chính trị Ba Đình – Hà Nội. Cuộc khai quật khảo cổ học lớn nhất Việt Nam và của cả Đông Nam Á này đã phát lộ những dấu vết của Hoàng thành Thăng Long trong tiến trình lịch sử trải dài 13 thế kỷ với các di tích và tầng văn hóa chồng xếp lên nhau.

# intro3
source: At 8:30 pm on July 31, 2010 local time in Brazil, which is 6:30 am on August 1, 2010 Vietnam time, the World Heritage Committee adopted a resolution recognizing the Central Area of Imperial Citadel of Thang Long - Hanoi as a World Cultural Heritage. This is a pride not only of Hanoi but also of the whole country of Vietnam.
vi: Vào lúc 20 giờ 30 ngày 31/7/2010 theo giờ địa phương tạiBrasil, tức 6 giờ 30 ngày 1/8/2010 theo giờ Việt Nam, Ủy ban di sản thế giới đã thông qua Nghị quyết công nhận khu Trung tâm Hoàng thành Thăng Long – Hà Nội là Di sản Văn hóa thế giới. Đây là niềm tự hào của không chỉ của riêng Hà Nội mà còn của cả đất nước Việt Nam.

# intro4
source: With systematically, fully and timely updated data information, the editorial board of the website www.hoangthanhthanglong.vn hopes to help readers, domestic and foreign tourists and those interested in the World Heritage of Imperial Citadel of Thang Long understand more about the outstanding universal values of this precious heritage.
vi: Với những thông tin dữ liệu được cập nhật một cách hệ thống, đầy đủ, kịp thời, Ban biên tập website www.hoangthanhthanglong.vn mong muốn giúp cho độc giả, khách du lịch trong nước và nước ngoài và những ai quan tâm đến Di sản thế giới Hoàng thành Thăng Long hiểu thêm về những giá trị nổi bật toàn cầu của Di sản quý giá này.

# news1
source: Annual Event
vi: Sự kiện thường niên

# new2
source: Incense Offering Ceremony
vi: Lễ dâng hương

# new3
source: This is a traditional cultural activity within the framework of the Vietnamese Tet program celebrating the Party, celebrating the Spring of the Year of the Dog 2018, including many activities of display, exhibition, education of heritage and traditional culture at the Imperial Citadel of Thang Long. The Spring Opening Ceremony is a highlight in the series of activities serving the people to welcome the Spring Festival, organized from the 23rd of the Lunar December of the Year of the Rooster to the full moon of the Lunar January of the Year of the Dog. Before that, some traditional rituals were also researched and reproduced such as the ceremony of worshipping the Land Genie and the Kitchen Gods, the ceremony of erecting and lowering the Neu tree, attracting a large number of visitors to experience the customs, and traditional rituals on the Tet holiday of the ethnic groups.
vi: Đây là hoạt động văn hóa truyền thống trong khuôn khổ chương trình Tết Việt mừng Đảng, mừng Xuân Mậu Tuất 2018, gồm nhiều hoạt động trưng bày, triển lãm, giáo dục di sản và văn hóa truyền thống tại Hoàng thành Thăng Long. Lễ dâng hương khai Xuân là điểm nhấn trong chuỗi các hoạt động phục vụ nhân dân đón Xuân vui Tết, được tổ chức từ 23 tháng Chạp năm Đinh Dậu đến rằm tháng Giêng năm Mậu Tuất. Trước đó một số nghi lễ truyền thống cũng được nghiên cứu, tái hiện như lễ cúng ông Công ông Táo, lễ dựng cây Nêu và Lễ hạ cây Nêu, thu hút đông đảo khách tham quan trải nghiệm các phong tục, nghi lễ cổ truyền trong ngày Tết của dân tộc

# new4
source: Mid-Autumn Festival
vi: Tết Trung Thu

# new5
source: The Mid-Autumn Festival is an ancient festival in East Asian countries such as China, Taiwan, Vietnam, Japan, Korea, and this day is also a public holiday in some countries like Taiwan, North Korea, and South Korea. In Vietnam, the Mid-Autumn Festival according to the lunar calendar is on the 15th of the 8th lunar month every year, now it has become a children's festival, called by different names depending on each period and region such as Children's Tet, Moon-watching Tet, or Lantern Festival... Children eagerly anticipate this festival because they receive toys, usually lanterns, star lanterns, masks, lion heads, lion dance lanterns, to he (toy figurines made from glutinous rice powder), lion dance heads... On this festival day, people arrange trays, admire the moon. When the moon rises high, children both dance and sing while admiring the moon, breaking trays, enjoying baked cakes, sticky rice cakes... In some urban areas, people also organize drumming, lion dance, and dragon dance to let children enjoy themselves to the fullest.
vi: Tết Trung Thu là một lễ hội cổ xưa tại các quốc gia Đông Á như Trung Hoa, Đài Loan, Việt Nam, Nhật Bản, Triều Tiên, ngày này cũng là ngày nghỉ lễ tại một số quốc gia như Đài Loan, Bắc Triều Tiên và Hàn Quốc. . Ở Việt Nam, Tết Trung Thu theo âm lịch là ngày Rằm tháng 8 hằng năm, nay đã trở thành ngày tết của trẻ em, được gọi bằng những cái tên khác nhau tùy theo từng thời điểm và vùng miền như Tết thiếu nhi, Tết trông trăng hay Tết hoa đăng… Trẻ em rất mong đợi được đón tết này vì được tặng đồ chơi thường là đèn ông sư, đèn ông sao, mặt nạ, đèn kéo quân, tò he, đầu sư tử… Vào ngày tết này, người ta tổ chức bày cỗ, trông trăng. Thời điểm trăng lên cao, trẻ em sẽ vừa múa hát vừa ngắm trăng phá cỗ, chén bánh nướng, bánh dẻo… Ở một số nơi đô thị người ta còn tổ chức đánh trống múa lân, múa sư tử, múa rồng để các em vui chơi thỏa thích.

# tour1
source: Ticket prices:
vi: Giá vé tham quan:

# tour2
source: - Adults: 70,000 VND/turn. - Students, students from 16 years old (if having student cards), elderly people (60 years old and above) who are Vietnamese citizens (presenting identity cards or any other documents proving that they are elderly people): 35,000 VND/turn. - Free admission for children under 16 and people who have contributed to the revolution.
vi: - Người lớn: 70.000 đồng/lượt. - Học sinh, sinh viên từ 16 tuổi trở lên (nếu có thẻ học sinh, sinh viên), người cao tuổi (60 tuổi trở lên) là công dân Việt Nam (xuất trình chứng minh thư hoặc bất kỳ giấy tờ khác chứng minh là người cao tuổi): 35.000 đồng/lượt. - Miễn phí tham quan cho trẻ em dưới 16 tuổi và người có công với cách mạng.

# tour3
source: Visiting hours:
vi: Thời gian tham quan:

# tour4
source: Open: From 8:00 to 17:00 daily.
vi: Mở cửa: Từ 8h00 đến 17h00 hàng ngày.

# tour5
source: Regulations:
vi: Nội quy:

# tour6
source: - Follow the tour guide map in the monument area. - Do not bring weapons, explosives, flammable substances, toxic substances, and substances with foul odors into the monument area. - Neat and polite attire. No uncultured behaviors such as: vulgar language, swearing, writing or drawing on walls, tree trunks, causing disorder in the monument area. - Cars, motorbikes must be parked in the designated area (at 19C Hoang Dieu). - Consciously protect monuments, relics; maintain environmental hygiene, dispose of rubbish in designated areas. Do not climb trees, break branches, pick fruits, or trample on grass. - Units, groups in need of tour guides, please contact the Guide Department for assistance. Agencies, individuals wishing to film, produce films must have an introduction letter and consent from the leadership of the Thang Long - Hanoi Heritage Conservation Center. - Do not use ultralight flying devices (flycams) in the heritage area.
vi: - Thực hiện theo sơ đồ chỉ dẫn tham quan trong khu di tích. - Không mang vũ khí, chất nổ, chất dễ cháy, chất độc hại và những chất có mùi hôi tanh vào khu di tích. - Trang phục gọn gàng, lịch sự. Không có những hành vi thiếu văn hóa như : nói tục, chửi bậy, viết vẽ lên tường, lên gốc cây, gây mất trật tự trong khu di tích. - Các phương tiện ô tô, xe máy phải để đúng nơi quy định (tại 19C Hoàng Diệu). - Có ý thức bảo vệ di tích, di vật; giữ gìn vệ sinh môi trường, bỏ rác đúng nơi quy định. Không tự ý trèo cây, bẻ cành, hái quả, dẫm lên thảm cỏ. - Đơn vị, tập thể có nhu cầu hướng dẫn tham quan, liên hệ với Phòng Hướng dẫn Thuyết minh để được phục vụ. Các cơ quan, cá nhân có nhu cầu quay phim, dựng phim phải có giấy giới thiệu và được sự đồng ý của lãnh đạo Trung tâm bảo tồn di sản Thăng Long - Hà Nội. - Không sử dụng thiết bị bay siêu nhẹ (flycam) tại khu di sản.

# dest1
source: Typical Monuments
vi: Di tích tiêu biểu

# cotCo1
source: Hanoi Flag Tower
vi: Cột cờ Hà Nội

# cotCo2
source: The "Hanoi Flag Tower" is located on Dien Bien Phu Street, in Ba Dinh District, Hanoi. It was built in 1812, during the reign of King Gia Long of the Nguyen Dynasty, on the southern part of the land of the Thang Long Imperial Citadel, where the Tam Mon Gate of the Thang Long Imperial Citadel was built during the time of the Le Dynasty. This tower serves as a landmark, marking the beginning at the southern end of the central axis of the citadel, from here along the "fish tail" path, through the Doan Mon Gate, to the most important point, the central point of the citadel which is Kinh Thien Palace. The Hanoi Flag Tower is now the most intact and magnificent structure within the complex of the Thang Long Imperial Citadel. The Flag Tower is constructed with three pedestal layers and a column shaft. The pedestal layers are in the shape of truncated square pyramids, diminishing in size and stacked on top of each other, surrounded by brick cladding. The first layer is 42.5 meters long, 3.1 meters high, with two brick staircases leading up. The second layer is 27 meters long, 3.7 meters high, with 4 doors. The east-facing door is inscribed with the words "Nghenh Huc" (welcoming the morning light), the west-facing door with the words "Hoi Quang" (reflecting light), the south-facing door with the words "Huong Minh" (facing the light), and the north-facing door without an inscription. The third layer is 12.8 meters long, 5.1 meters high, with a door leading to the observation bridge facing north. On this layer is the column shaft, 18.2 meters high, octagonal in shape, tapering upwards, with each base side about 2 meters. Inside the shaft is a spiral staircase of 54 steps leading to the top. The entire structure is illuminated (and ventilated) by 39 fan-shaped openings. The top of the Flag Tower consists of an octagonal pavilion, 3.3 meters high, with 8 windows corresponding to the eight sides. In the middle of the pavilion is a cylindrical column, 40cm in diameter, extending to the top of the pavilion, where the flagpole (8 meters high) is inserted. The entire Flag Tower is 33.4 meters high, and if the flagpole is included, it reaches 41.4 meters. The Hanoi Flag Tower is one of the few architectural works in the Hanoi Citadel area that escaped destruction by the French colonial authorities during the years 1894-1897. On October 10, 1954, for the first time, the red flag with a yellow star - the national flag - was raised on the top of the Hanoi Flag Tower and was recognized as a historical monument in 1989. On October 10, 1954, Hanoi celebrated the great victory, the day of liberation. The whole city gathered at the Hanoi Flag Tower to witness the historic moment: the flag-raising ceremony of the national flag on the top of the Hanoi Flag Tower. At exactly 3 p.m. on October 10, 1954, the horn of the City Theater sounded. The military band followed the direction of Comrade Dinh Ngoc Lien, pulling up the national flag according to the military march rhythm. For the first time, the red flag with a yellow star - the national flag - flew on the top of the Hanoi Flag Tower. From the time of its construction to the present day, the Hanoi Flag Tower has been nearly two hundred years old. When the Democratic Republic of Vietnam was established, the image of the Hanoi Flag Tower was solemnly printed on the first banknotes issued by the State Bank of Vietnam. For over half a century, atop the Hanoi Flag Tower, the red flag with five-pointed yellow star flies proudly against the sky of the Thousand-Year-Old Capital Hanoi, forever a symbol of glory and pride of the independent and free Vietnamese nation. According to research documents, since 1986, a red flag with a yellow star measuring 24 square meters has always flown atop the Hanoi Flag Tower. Today, the Hanoi Flag Tower is located on Dien Bien Phu Street, surrounded by ancient banyan trees and at its foot is a lush lychee garden. According to some research documents, in a photo taken in 1890 by Louis Sadoul, a French military doctor, the area of the Lenin Statue Flower Garden at the foot of the current flagpole was once a pond for bathing elephants of the Nguyen Dynasty court. The ancient banyan trees seen today were not yet planted at that time. In the photo, it can also be seen that the French army built a solid camp on the terraces of the Flag Tower to station troops. During this period, the Hanoi Flag Tower was also used by the French army as an observation post. During the destructive war waged by the United States, the Flag Tower was also used as an observation post by the Hanoi air defense forces. At that time, from the top of the Flag Tower, one could see both Hanoi and the suburban areas. What is especially remarkable is that even during the hottest days in Hanoi, the temperature inside the Flag Tower remains cool as if it has air conditioning. The structure of the ascending and descending doors of the Flag Tower is also so scientific that no matter how heavy the rain is, water does not flow into the tower.
vi: Kỳ đài “Cột cờ Hà Nội” nằm trên đường Điện Biên Phủ, thuộc quận Ba Đình, Hà Nội, được xây dựng năm 1812, dưới thời Vua Gia Long triều Nguyễn trên phần đất phía nam của Hoàng thành Thăng Long, nơi xây tòa thành Tam Môn của Hoàng thành Thăng Long thời Lê. Đây là điểm chuẩn, đánh dấu sự khởi nguyên ở đầu phía nam trục chính tâm của tòa thành, từ đây theo đường “ngư đạo”, qua Đoan Môn rồi tới điểm quan trọng nhất, điểm trung tâm của Hoàng thành là điện Kính Thiên. Cột cờ Hà Nội nay là công trình còn nguyên vẹn và hoành tráng nhất trong quần thể di tích Hoàng thành Thăng Long. Cột Cờ được xây dựng bao gồm ba tầng đế và một thân cột. Các tầng đế hình chóp vuông cụt, nhỏ dần, chồng lên nhau, xung quanh xây ốp gạch. Tầng một mỗi chiều dài 42,5m; cao 3,1m có hai thang gạch dẫn lên. Tầng hai, mỗi chiều dài 27m; cao 3,7m có 4 cửa, cửa hướng Đông trên có đắp hai chữ “Nghênh Húc” (đón ánh sáng ban mai), cửa Tây với hai chữ “Hồi Quang” (ánh sáng phản chiếu), cửa Nam với hai chữ “Hướng Minh” (hướng về ánh sáng), cửa Bắc không có chữ đề. Tầng ba, mỗi chiều dài 12,8m; cao 5,1m có cửa lên cầu thanh trông về hướng Bắc. Trên tầng này là thân Cột Cờ, cao 18,2m; hình trụ tám cạnh, thon dần lên trên, mỗi cạnh đáy chừng 2m. Trong thân có cầu thang 54 bậc xây xoáy trôn ốc lên tới đỉnh. Toàn thể được soi sáng (và thông hơi) bằng 39 lỗ hình dẻ quạt. Đỉnh Cột Cờ được cấu tạo thành một cái lầu hình bát giác, cao 3,3m có 8 cửa sổ tương ứng với tám cạnh. Giữa lầu là một hình trụ tròn, đường kính 40cm cao đến đỉnh lầu, là chỗ để cắm cán cờ (cán cờ cao 8m). Toàn bộ Cột Cờ cao 33,4m, nếu kể cả cán cờ thì là 41,4m. “Cột cờ Hà Nội” là một trong số ít những công trình kiến trúc thuộc khu vực thành Hà Nội có may mắn thoát khỏi sự phá hủy do chính quyền đô hộ Pháp tiến hành trong ba năm 1894-1897. Ngày 10/10/1954, lần đầu tiên lá cờ đỏ sao vàng – cờ Tổ quốc tung bay trên đỉnh “Cột cờ Hà Nội” và được công nhận là di tích lịch sử năm 1989. Ngày 10/10/1954, cả Hà Nội tưng bừng rạo rực chào đón ngày hội lớn, ngày Hội chiến thắng, Thủ đô Hà Nội hoàn toàn giải phóng. Cả Hà Nội dồn về “Cột cờ Hà Nội” chờ đón giây phút lịch sử: Lễ thượng cờ Tổ quốc trên đỉnh “Cột cờ Hà Nội”. Đúng 15 giờ, ngày 10/10/1954, còi nhà hát Thành phố nổi lên một hồi dài. Đoàn quân nhạc cử Quốc thiều theo sự điều khiển của đồng chí Đinh Ngọc Liên, Lá cờ tổ quốc được kéo lên từ từ theo nhịp khúc quân hành. Lần đầu tiên lá cờ đỏ sao vàng – cờ Tổ quốc tung bay trên đỉnh “Cột cờ Hà Nội”. Từ ngày xây dựng đến nay, “Cột cờ Hà Nội” đã gần hai trăm năm tuổi. Khi Nhà nước Việt Nam Dân chủ Cộng hòa ra đời, hình ảnh của “Cột cờ Hà Nội” đã được in trang trọng trên đồng tiền của Ngân hàng Nhà nước Việt Nam phát hành lần đầu tiên. Hơn nửa thế kỷ qua, gắn trên đỉnh “Cột cờ Hà Nội” là lá cờ đỏ sao vàng năm cánh tung bay lồng lộng trên nền trời của Thủ đô Thăng Long-Hà Nội ngàn năm văn hiến, mãi mãi là biểu tượng vinh quang, là niềm tự hào của dân tộc, đất nước Việt Nam độc lập, tự do. Theo tài liệu nghiên cứu, từ năm 1986, một lá cờ đỏ sao vàng kích cỡ 24m2 vuông luôn tung bay trên Cột cờ Hà Nội. Cột cờ Hà Nội ngày nay nằm bên đường Điện Biên Phủ, với những cây xà cừ cổ thụ mọc xung quanh và dưới chân là một vườn nhãn um tùm. Theo một số tài liệu nghiên cứu, trong một bức ảnh được chụp vào năm 1890 bởi Louis Sadoul, một sĩ quan quân y Pháp, khu vực vườn hoa Tượng đài Lenin dưới chân cột cờ ngày nay còn là hồ Voi vì là nơi tắm voi của triều đình nhà Nguyễn. Còn các rặng cây cổ thụ ngày nay khi đó còn chưa được trồng. Trong ảnh, còn có thể thấy quân Pháp đã dựng doanh trại bán kiên cố trên các vòng thành của Cột cờ để đóng quân. Cũng trong thời kỳ này, Cột cờ Hà Nội còn được quân Pháp dùng để làm đài quan sát. Trong cuộc chiến tranh phá hoại của Mỹ, Cột cờ cũng là đài quan sát của bộ đội phòng không Hà Nội. Khi đó, từ đỉnh cột cờ có thể nhìn thấy cả Hà Nội và vùng ngoại ô. Điều đặc biệt là giữa những ngày nóng nhất của Hà Nội, nhiệt độ bên trong của Cột cờ luôn mát mẻ như có máy lạnh. Kết cấu các cửa lên xuống của Cột cờ cũng khoa học đến mức mưa lớn đến đâu nước cũng không chảy vào trong lòng tháp.

# doanMon1
source: The main gate (Doan Mon)
vi: Đoan Môn
