Repository: tramanh1511/ThangLongAR
Catalog: lib/l10n/app_*.arb
Languages: vi

# doanMon2
source: Doan Mon is one of the main gates leading into the Forbidden City. Based on the building materials and remaining architectural style of the relic, it can be confirmed that Doan Mon was built during the Lê Dynasty and renovated during the Nguyen Dynasty. The relic is located to the south of Kinh Thien Palace, directly aligned with the Flag Tower of Hanoi. Doan Mon is constructed horizontally in a U-shaped structure. It follows the architectural style of ancient city walls, with five gates built with nearly symmetrical vaulted arches across the 'divine axis,' also known as the 'central axis' of the Imperial Citadel. The main architectural feature is in the style of a watchtower, with three arched doors. The vaulted arch architecture of the city gates not only provides graceful curves but also has an exceptionally strong load-bearing structure. Even to this day, the most modern and grand underground structures in the world still use this architectural style. The main materials used are brick, a common type of brick from the Lê Dynasty, and stone for the gate's vault. From east to west, it is 47.5m long; from south to north, the middle section measures 13m, and the two side wings are 26.5m long and 6m high. The central gate, reserved for the king, is 4m high and 2.7m wide. On either side are four smaller doors, each 3.8m high and 2.5m wide, used by officials and princes to enter and exit the Forbidden City whenever there were royal decrees or to participate in major ceremonies at Kinh Thien Palace conducted by the Emperor. A stone plaque engraved with the words 'Doan Mon' is affixed above the main gate, measuring 1.5m long and 0.7m wide. There are small brick steps on both sides leading to the second floor. This floor corresponds to the area of the central main gate. Due to renovations for military purposes, the original architecture has not been fully studied. On the roof of the second floor is a small two-story octagonal pavilion. The tiled roof is adorned with two dragon heads (at the ends), with a tiger relief in the middle; the four corners of the roof form curved blades. In 1999, archaeologists excavated a pit right in the middle of the current Doan Mon gate to search for traces of the ancient Imperial Road. At a depth of 1.2m, the stone border of the Doan Mon wall footing and a stone-paved courtyard from the Lê Dynasty were uncovered. At a depth of 1.9m, traces of a 'lotus flower' tiled road from the Tran Dynasty were found. Heading southeast, it is predicted that the road extends further and is likely the path from Doan Mon to the Thiên An Palace during the Tran Dynasty. Notably, among the Tran Dynasty tiled road bricks, there are reused bricks from the Ly Dynasty. Thus, the archaeological results at Doan Mon further reinforce the hypothesis that Doan Mon during the Ly, Tran, and Lê Dynasties was essentially located in the same position.'
vi: Đoan Môn Là một trong những cổng chính dẫn lối vào Cấm thành. Căn cứ vào vật liệu xây dựng và phong cách kiến trúc hiện còn của di tích, có thể khẳng định Đoạn Môn hiện nay được xây dựng được xây dựng vào thời Lê và được tu bổ sửa sang vào thời Nguyễn. Di tích nằm ở hướng Nam của điện Kinh Thiên thẳng trục với Cột Cờ Hà Nội. Đoạn Môn được xây dựng theo chiều ngang, cấu trúc hình chữ U. Đoan Môn được xây theo lối tường thành cổ với 5 cổng thành được dựng cuốn vòm cân xứng gần như tuyệt đối qua “trục thần đạo”, hay còn được gọi là “trục chính tâm” của Hoàng thành. Phần kiến trúc chính làm kiểu vọng lâu, với 3 cửa vòm cuốn. Kiến trúc cuốn vòm ở các cổng thành không chỉ mang lại những đường cong duyên dáng, mà còn có kết cấu chịu lực cực tốt. Cho đến ngày nay, những công trình đường hầm hiện đại nhất, kỳ vĩ nhất trên thế giới cũng vẫn sử dụng lối kiến trúc này. Vật liệu chủ yếu là gạch vồ, loại gạch phổ biến của thời Lê và đá, cuốn vòm cửa. Từ đông sang tây dài 47,5m, từ nam lên bắc đoạn giữa đo đc 13m, cánh gà hai bên đo được 26,5m, cao 6m. Cửa giữa lớn nhất dành riêng cho nhà vua, cao 4m, rộng 2,7m. Hai bên có 4 cửa nhỏ hơn, cao 3,8m rộng 2,5m dùng để các quan, hoàng thân quốc thích ra vào cung cấm mỗi khi có lệnh vời hoặc tham dự các nghi lễ lớn tại điện Kính Thiên do Hoàng đế tiến hành Tấm biển đá khắc hai chữ Đoan Môn, gắn phía trên cửa chính dài 1,5m rộng 0,7m. Hai bên có những bậc gạch nhỏ dẫn lên tầng hai. Tầng này có diện tích tương ứng với cửa chính giữa. Do bị cải tạo làm cơ sở làm việc cho quân đội nên kiến trúc cũ chưa thể khảo cứu được. Trên nóc tầng hai xây một phương đình nhỏ kiểu hai tầng tám mái. Mái lợp ngói ta, hai đầu nóc đắp hai con rồng (đầu kìm), hài hồi đắp hình hổ phù; 4 góc mái trên tạo thành đao cong. Năm 1999, các nhà khảo cổ học đã chọn hố khai quật ngay tại chính giữa cửa Đoan Môn hiện còn để lần tìm dấu vết con đường Ngự đạo xưa. Ngay ở độ sâu 1,2m đã xuất lộ một đường viền đá lát chân tường Đoan Môn, một sân lát đá gạch vồ thời Lê và ở độ sâu 1,9m đã xuất lộ dấu tích một con đường lát gạch “hoa chanh” thời Trần. Theo hướng Bắc Nam, con đường được dự đoán còn kéo dài hơn nữa và rất có thể đó là con đường đi từ Đoan Môn đến điện Thiên An thời Trần. Đáng chú ý là trong số gạch lát con đường thời Trần còn có những viên gạch thời Lý được dùng lại. Như vậy kết quả khảo cổ học tại Đoan Môn càng củng cố thêm giả thiết về Đoan Môn thời Lý, Trần, Lê về cơ bản đã tọa lạc tại cùng một vị trí.

# kinhThien1
source: Kinh Thien Palace
vi: Điện Kính Thiên

# kinhThien2
source: This is the central relic, among the overall relics of the Central Imperial Citadel of Thang Long - Hanoi. Kinh Thien Palace - the most important palace, where the most solemn ceremonies of the royal court are held, where foreign emissaries are welcomed and where important national affairs are held in court. ' According to "Dai Viet Su Ky Toan Thu", Kinh Thien Palace was built in 1428 during the reign of King Le Thai To and completed during the reign of King Le Thanh Tong. Kinh Thien Palace was built on Nung Mountain, right on the old foundation of Can Nguyen - Thien An palace during the Ly and Tran dynasties. Naming the adoration hall after Can Nguyen, Ly Thai To chose the right center of heaven and earth to place his throne to rule the country. After the Ly dynasty kings, the Tran and Le dynasties built a rampart system here. The important area is Cam Thanh (or Long Thanh, Long Phuong Thanh) in Thang Long citadel during the Ly - Tran - Le dynasties. The center is Can Nguyen palace, Thien An palace under Ly - Tran dynasty, Kinh Thien palace under Le dynasty. Since 1788, when King Quang Trung established his capital in Phu Xuan - Hue and then the Nguyen Dynasty (1802 - 1945) also established its capital here, Thang Long citadel became the headquarters of Tran Bac Thanh. In 1805, King Gia Long built this area as a palace for the king to use whenever the Nguyen kings "came to the North". The name "Hanoi Citadel" appeared in 1831, when King Minh Mang carried out a major administrative reform, establishing provinces across the country, including Hanoi province. Hanoi Citadel is the headquarters of Hanoi province. Noi. During the French colonial period, at the end of the 19th century, the French colonialists demolished Kinh Thien palace and built an artillery command headquarters here. This house is called the Dragon house (also known as Long Tri), because there are stone dragons flanking it in front and back. After October 10, 1954, when our troops took over the capital, this area became the workplace of the Ministry of National Defense. In 2004, the Ministry of National Defense handed over a part of the central area (central axis) of Thang Long - Hanoi Citadel to the Hanoi People's Committee for management. Architecture Kinh Thien Palace is a central relic, the main nucleus in the overall historical sites of Hanoi Ancient Citadel. In front of Kinh Thien Palace is Doan Mon, then Hanoi Flagpole, behind is Hau Lau, Bac Gate, the east and west sides have walls and small doors. These gates have been classified by the French protectorate since 1925 along with a number of other relics in the ancient citadel. Kinh Thien Palace is the central building of the royal palace during the Le Dynasty (15th - 18th centuries) in Thang Long - Dong Kinh (Hanoi). In 1428, after the victory over the Ming army, Le Thai To continued to base his capital in Thang Long, building and repairing the damaged royal citadel. Kinh Thien Palace was built during this period. By 1886, the palace was destroyed, only the ruins of the steps and palace foundation remain (in today's Hanoi Ancient Citadel). Observing the architecture of Kinh Thien Palace through photos taken by the French in the late 19th century, we can see that Kinh Thien Palace is a wooden structure consisting of two folds shaped like the letter Nhi (二). The house is made of a 2-storey, 8-roof matchbox style with curved corners. The roofs of both houses are embossed with a pair of dragons flanking the sun. Around the palace there is a large yard with railings on all four sides. The remains of Kinh Thien Palace today are only the old foundation. The palace's foundation is 57m long, 41.5m wide, 2.3m high and the steps are built of green stone forming three entrances. On the south side of the palace, there is also a railing over 100 cm high. The front, main south direction of Kinh Thien Palace is a terrace built of large stone slabs consisting of 10 steps with 4 stone dragons divided into 3 equal paths, forming the Dragon Shelf. The steps have dimensions: 13.7 m horizontal, 4.45 m vertical, 2.1 m high with a pair of stone dragons carved in 1467 which are relatively intact stone sculptures.The Stone Dragon of Kinh Thien Palace is a masterpiece of architectural and artistic heritage, typical of the sculpture art of the Early Le Dynasty. Carved from green stone, the stone dragon has a raised head, a large head, round and bulging eyes, long horns with branches, and a mane that curves back. The dragon's body curves softly into many arcs, gradually getting smaller towards the temple floor. On its back is a long fin that undulates like clouds and sparks.On the north side of Kinh Thien Palace's foundation, there is also a 7-step platform that is smaller than the main platform on the south side. On both sides of the steps there are 2 stone dragons dating back to Le Trung Hung (17th-18th centuries), 3.4m long dragons; 7 bends, scaly body, back like a row of fish fins, 5 clawed dragon feet... Both sides of the railing are decorated with lotus flowers, water waves, swords, fire, clouds... The foundation and steps of the palace are the few relics of the royal palace architecture of the Le Dynasty that remain today, partly reflecting the majestic scale of the ancient Kinh Thien Palace.Today, this space has become a "dual" monument for both eras: Kinh Thien Palace of the ancient Thang Long Imperial Citadel and the General Command of the Vietnam People's Army - an important historical relic of the modern history of Vietnam.'
vi: Đây là di tích trung tâm, trong tổng thể các di tích của khu Trung tâm Hoàng thành Thăng Long – Hà Nội. Điện Kính Thiên – cung điện quan trọng bậc nhất, nơi cử hành các nghi lễ long trọng nhất của triều đình, nơi đón tiếp sứ giả nước ngoài và là nơi thiết triều bàn những việc quốc gia đại sự. Theo “Đại Việt Sử ký toàn thư”, điện Kính Thiên được xây dựng năm 1428 đời Vua Lê Thái Tổ và hoàn thiện vào đời Vua Lê Thánh Tông. Điện Kính Thiên được xây dựng trên núi Nùng, ngay trên nền cũ của cung Càn Nguyên – Thiên An thời Lý, Trần.Lấy Càn Nguyên đặt tên cho điện coi chầu, Lý Thái Tổ đã chọn đúng trung tâm của trời đất đặt ngai vàng để trị nước. Sau các vua nhà Lý, các vua nhà Trần, nhà Lê đã cho xây dựng hệ thống thành lũy tại đây. Khu vực quan trọng là Cấm Thành (hay Long Thành, Long Phượng Thành) trong thành Thăng Long thời Lý – Trần – Lê. Trung tâm là điện Càn Nguyên, Thiên An thời Lý – Trần, điện Kính Thiên thời Lê.Từ năm 1788, khi Vua Quang Trung đóng đô ở Phú Xuân – Huế và sau đó nhà Nguyễn (1802 – 1945 ) cũng định đô tại đây thì thành Thăng Long trở thành trụ sở của Trấn Bắc Thành. Năm 1805, Vua Gia Long cho xây dựng khu vực này làm hành cung để vua sử dụng mỗi khi các vua nhà Nguyễn “Bắc tuần”. Tên “Thành cổ Hà Nội” xuất hiện từ năm 1831, khi Vua Minh Mạng thực hiện cuộc cải cách hành chính lớn, thành lập các tỉnh trên cả nước, trong đó có tỉnh Hà Nội, Thành Hà Nội là trụ sở của tỉnh Hà Nội.Thời Pháp thuộc, vào cuối thế kỷ XIX, thực dân Pháp phá bỏ hành cung Kính Thiên và xây dựng trụ sở chỉ huy pháo binh tại đây. Ngôi nhà này được gọi là nhà Con Rồng (hay còn gọi là Long Trì), do phía trước và sau đều có rồng đá chầu.Sau ngày 10/10/1954, khi quân ta vào tiếp quản Thủ đô, khu vực này trở thành nơi làm việc của Bộ Quốc phòng. Năm 2004, Bộ Quốc phòng bàn giao lại một phần diện tích khu vực trung tâm (trục chính tâm) Thành cổ Thăng Long – Hà Nội cho UBND thành phố Hà Nội quản lý. Kiến trúc Điện Kính Thiên là di tích trung tâm, là hạt nhân chính trong tổng thể các địa danh lịch sử của Thành cổ Hà Nội. Trước điện Kính Thiên là Đoan Môn rồi tới Cột cờ Hà Nội, phía sau có Hậu Lâu, Cửa Bắc, hai phía đông và tây có tường bao và mở cửa nhỏ. Các cửa này đã được nhà nước bảo hộ Pháp liệt hạng từ năm 1925 cùng với một số di tích khác ở thành cổ. Điện Kính Thiên là công trình trung tâm của hoàng cung thời nhà Lê (thế kỉ XV – XVIII) ở Thăng Long – Đông Kinh (Hà Nội). Năm 1428, sau chiến thắng quân Minh, Lê Thái Tổ tiếp tục đóng đô tại Thăng Long, cho xây dựng sửa sang lại hoàng thành bị hư hại. Điện Kính Thiên được xây dựng trong thời kì này. Đến 1886, điện bị phá huỷ, hiện chỉ còn di tích thềm bậc và nền điện (trong khu Thành cổ Hà Nội ngày nay).Quan sát kiến trúc điện Kính Thiên qua các bức ảnh do người Pháp chụp cuối thế kỷ XIX, chúng ta có thể thấy Điện Kính Thiên là một kiến trúc gỗ gồm 2 nếp hình chữ Nhị (二). Nhà làm kiểu chồng diêm 2 tầng 8 mái với các góc đao cong. Bờ nóc của cả hai nếp nhà đều đắp nổi đôi rồng chầu mặt trời. Quanh điện có sân rộng được xây lan can bao cả 4 phía. Dấu tích điện Kính Thiên hiện nay chỉ còn là khu nền cũ. Nền điện dài 57m, rộng 41,5 m, cao 2,3 m và thềm bậc xây bằng đá xanh tạo thành ba lối vào. Phía nam nền điện còn có hàng lan can cao hơn 100 cm. Mặt trước, hướng chính nam của điện Kính Thiên là thềm điện xây bằng những phiến đá hộp lớn gồm 10 bậc có 4 rồng đá chia thành 3 lối lên đều nhau tạo thành Thềm Rồng. Thềm bậc có kích thước: ngang 13,7 m, dọc 4,45 m, cao 2,1m với đôi rồng đá khắc chạm năm 1467 là những bộ phận điêu khắc bằng đá còn tương đối nguyên vẹn. Rồng đá điện Kính Thiên là một di sản kiến trúc nghệ thuật tuyệt tác, tiêu biểu cho nghệ thuật điêu khắc thời Lê sơ. Được chạm trổ bằng đá xanh, rồng đá có đầu nhô cao, đầu to, mắt tròn lồi, sừng dài có nhánh, bờm lượn ra sau. Thân rồng uốn lượn mềm mại thành nhiều vòng cung, nhỏ dần về phía nền điện, trên lưng có đường vây dài nhấp nhô như vân mây, tia lửa. Phía bắc của nền Điện Kính Thiên còn có một thềm 7 bậc lên xuống nhỏ hơn so với bậc thềm chính ở phía nam. Hai bên bậc thềm có 2 rồng đá mang niên đại Lê Trung Hưng (thế kỷ XVII-XVIII ), rồng dài 3,4m; uốn 7 khúc, thân có vẩy, lưng như hàng vây cá, chân rồng 5 móng… Hai bên lan can trang trí hoa sen, sóng nước, đao, lửa, vân mây… Nền và thềm bậc điện là di tích ít ỏi trong kiến trúc hoàng cung thời Lê còn sót lại đến ngày nay, phần nào phản ánh được quy mô hoành tráng của điện Kính Thiên xưa.Ngày nay, không gian nơi này đã trở thành một di tích “kép” cho cả hai thời đại: Điện Kính Thiên của Hoàng thành Thăng Long xưa và Bộ Tổng Chỉ huy Quân đội nhân dân Việt Nam- di tích lịch sử quan trọng của lịch sử hiện đại Việt Nam.

# bacMon1
source: Northern gate (Bac Mon)
vi: Bắc Môn

# bacMon2
source: Bac Mon (North Gate), built by the Nguyen Dynasty in 1805 on the foundation of the Lê Dynasty's North Gate, follows the style of a watchtower – the upper part is a floor while the lower part is a fortress, standing 8.71m tall, 17.08m wide, with walls 20.48m thick. The upper floor is constructed with wooden frames in a traditional eight-panel roof style, covered with red tiles and featuring doors opening in all four directions. Rainwater on the watchtower is drained down through two stone gutters. Standing on the city gate, military commanders could oversee the entire interior and exterior of the citadel, easily observing any movements or changes in the enemy's formations. Therefore, even after capturing Hanoi, the French military continued to use the upper floor of Bac Mon as a guard post. Today, the upper floor of the city gate has been partially restored and dedicated as a place of worship for two notable governors of Hanoi – Nguyen Tri Phuong and Hoang Dieu - who sacrificed themselves due to the inability to defend the citadel against the firepower of the French army. Many people still regularly climb Bac Mon watchtower to light incense and pay homage to these brave heroes – individuals so revered that modern-day streets running alongside the ancient citadel are named after them. The fortress was built solidly with stone and brick, with stone foundations and a brick vaulted gate created by alternating horizontal and vertical bricks. The bricks used in the construction were 35.5cm x 10cm x 12cm in size, while the supporting stones ranged in length from 38 to 86cm. The rectangular-shaped stone doorframe was adorned with lotus motifs. The two wooden gate wings have been renovated, with a total area of 24m² and a weight of around 16 tons, running on copper wheels weighing approximately 80kg each. On the outer side above the city gate are three Han Chinese characters carved in stone: 'Chinh Bac Mon' with decorative floral patterns. According to historical records and photographic evidence from the time of Hanoi's citadel, the two sides of Bac Mon inside the city walls feature triangular-shaped staircases leading up to the watchtower. In front of Bac Mon is a brick bridge spanning a moat approximately 20m wide that encircles the citadel. Observers can easily see that the area currently occupied by the moat in front of Bac Mon is now a grassy area, sidewalk, and part of Phan Dinh Phung street. Some argue that the sturdy brick bridge leading to Bac Mon is not a drawbridge, so the moat does not serve a defensive purpose. However, others believe that while the entrance to the citadel is not a drawbridge, the defensive goal of the moat surrounding the ancient citadel is crucial – it helps limit enemy access to the citadel's base. Although Bac Mon was built by the Nguyen Dynasty, beneath this imposing city gate lie layers of relics from previous dynasties, affirming the continuous historical significance of the Imperial Citadel over thousands of years. In 1998, archaeologists discovered numerous architectural traces at Bac Mon at depths of 1.66m and 2.2m, including remnants of stone and brick walls dating back to the Lê Dynasty. Today, Bac Mon has become a popular destination for both domestic and international tourists. If one pays attention, they can easily notice two scars outside Bac Mon left by French cannonballs when they used warships to attack Hanoi from the Red River. When breaching the ancient walls of Hanoi, the French colonialists deliberately spared Bac Mon, both to serve as a lookout post and to boast about their "achievements" in capturing the capital. Recently, during the renovation of Bac Mon by Hanoi authorities, these two battle scars were deliberately preserved as a reminder of a time when Hanoi suffered under the boots of foreign invaders, and the brave people of Hanoi valiantly resisted the foreign aggressors.
vi: Bắc Môn (Cửa Bắc) được nhà Nguyễn xây dựng năm 1805 trên nền Cửa Bắc thời Lê theo lối vọng lâu – phần lầu ở trên còn phần thành ở dưới, cao 8,71m, rộng 17,08m, tường dày 20,48m. Phần lầu được dựng bằng khung gỗ theo lối chồng diêm tám mái, lợp ngói ta, trổ cửa ra bốn hướng. Nước mưa trên vọng lâu được dẫn thoát xuống dưới qua hai ống máng bằng đá. Đứng trên cổng thành, quan quân có thể phóng tầm mắt bao quát khắp trong ngoài thành, dễ dàng quan sát di – biến động trong đội hình quân địch. Do đó, khi chiếm được thành Hà Nội, quân đội Pháp vẫn sử dụng lầu trên Bắc Môn làm chòi canh gác. Hiện nay, lầu trên cổng thành mới được phục dựng một phần và được dành làm nơi thờ hai vị quan Tổng đốc thành Hà Nội – Nguyễn Tri Phương và Hoàng Diệu – đã tuẫn tiết vì không giữ được thành trước sức mạnh đạn pháo của quân đội Pháp. Nhiều người dân vẫn thường xuyên lên vọng lâu Bắc Môn để thắp nhang tưởng nhớ hai vị anh hùng lẫm liệt – những người được hậu thế kính cẩn dùng tên đặt cho hai con đường hiện đại chạy hai bên tả hữu vòng thành cổ năm xưa. Phần thành được xây dựng hết sức kiên cố bằng đá và gạch, chân kè bằng đá, cổng thành cũng được cuốn vòm bằng gạch theo lối xếp một viên gạch ngang xen một viên đặt dọc. Gạch xây thành có kích thước 35,5cm x 10cm x 12cm. Đá kê có kích thước dài từ 38 đến 86cm. Mép cửa kè đá hình chữ nhật, diềm trên bằng đá trang trí hoa sen. Hai cánh cổng thành bằng gỗ đã được trùng tu có tổng diện tích 24m2, trọng lượng khoảng 16 tấn, chạy trên bánh xe bằng đồng trọng lượng khoảng 80kg. Phía ngoài bên trên cổng thành còn ba chữ Hán khắc đá: “Chính Bắc Môn”, diềm biển trang trí hoa dây. Theo cứ liệu lịch sử và những bức ảnh tư liệu chụp từ thời thành Hà Nội chưa bị phá, hai bên Bắc Môn phía trong tường thành có lối dẫn lên vọng lâu được xây bằng gạch theo hình tam giác. Trước Bắc Môn là chiếc cầu gạch bắc qua con hào rộng khoảng 20m bao quanh thành. Quan sát bằng mắt thường có thể thấy, vị trí con hào phía trước Bắc Môn hiện nay chính là bãi cỏ, vỉa hè và một phần lòng đường phố Phan Đình Phùng. Có ý kiến cho rằng, chiếc cầu bắc qua hào vào Bắc Môn là cầu gạch kiên cố, không phải cầu treo nên con hào không mang tính phòng thủ. Tuy nhiên, nhiều ý kiến khác cho rằng, dù cầu vào thành không phải là cầu treo, nhưng mục tiêu phòng thủ của con hào bao quanh thành cổ là chính yếu – nó giúp hạn chế giặc tiếp cận chân thành. Dù Bắc Môn là công trình do nhà Nguyễn xây dựng, nhưng dưới chân cổng thành sừng sững này là tầng tầng lớp lớp di chỉ thành quách từ các triều đại trước đó, khẳng định sự liên tục trong lịch sử ngàn năm của Hoàng thành. Năm 1998, tại khu vực Bắc Môn, các nhà khảo cổ đã tìm thấy nhiều dấu vết kiến trúc ở độ sâu 1,66m và 2,2m, trong đó có vết tích của những đoạn tường thành xây bằng đá và gạch vồ thời Lê. Ngày nay, Bắc Môn trở thành một điểm đến được nhiều du khách trong và ngoài nước yêu thích. Và, nếu để ý, du khách có thể dễ dàng nhận thấy phía ngoài Bắc Môn vẫn còn lưu dấu 2 vết đạn thần công của Pháp khi chúng dùng chiến thuyền tấn công thành Hà Nội từ phía bờ sông Hồng. Lúc phá thành cổ Hà Nội, thực dân Pháp đã cố ý bớt lại Bắc Môn, vừa để làm vọng canh, lại vừa để khoe “chiến tích” đánh chiếm Hà thành. Mới đây, khi Bắc Môn được thủ đô Hà Nội trùng tu, hai vết thần công cũng được ta hữu ý giữ lại để ghi nhớ về một thuở Hà Nội quằn quại dưới gót giày xâm lược và nhân dân Hà Nội anh dũng chống trả giặc ngoại xâm.

# khaoCo1
source: Archaeological sites
vi: Khu Khảo Cổ 18 Hoàng Diệu
