Repository: tramanh1511/ThangLongAR
Catalog: lib/l10n/app_*.arb
Languages: vi

# khaoCo2
source: The archaeological relic site at 18 Hoang Dieu is located about 100m west of Kinh Thien Palace, in the unified whole of the heritage of the Central Citadel of Thang Long - Hanoi. Since December 2002, the largest archaeological excavation in Vietnam has been carried out at 18 Hoang Dieu. The archaeological excavation area is divided into 4 zones by the Institute of Archeology, named A, B, C, D. Important discoveries of underground archeology in the western area of ​​the central axis of the Forbidden City at 18 Hoang Dieu has revealed a complex of rich and diverse architectural relics with millions of relics from many periods stacked and interwoven, starting from the Dai La period (7th-9th centuries), Dinh, Early Le (10th century), Ly Dynasty (1009-1225), Tran (1226-1400), Le So (1428-1527), Mac (1527- 1592), Le Trung Hung (1593- 1789) and Nguyen (1802- 1945). The bottom layer is the architectural system of the Pre-Thang Long period, also known as the An Nam colonial period or Dai La, clearly shown through the system of wooden columns, architectural foundations, drainage pipes, and wells. water and relics such as "Jiangxi Quan" bricks, tube tiles decorated with images of divine animals, clown faces and many ceramics dating from the 7th - 9th centuries. ' The upper layer of the architecture of the Dai La period is the architectural trace of the Ly - Tran dynasties, clearly shown through the architectural plan system with gravel foundation pillars, brick foundations, lotus stone bases, brick courtyards, Sewer lines, especially decorative relics on architectural roofs, are large in size and elaborately decorated. Some locations have cultural vestiges of the Dinh - Early Le period. At the top is the architectural layer of the Le Dynasty, with traces of architectural foundations built of bricks, water well systems, especially the types of lapis lazuli and lapis lazuli tiles decorated with 5-claw dragons specifically used for roofing. on the roof of the king's palace and all kinds of porcelain used exclusively for the king. Some locations have cultural vestiges of the Nguyen Dynasty but they are faint and unclear. The soil layers bear the mark of all historical periods within the past 1,300 years, but have an orderly and continuous evolution, especially located in the center of the Imperial Citadel and the Forbidden Citadel of Thang Long. Long. This area is an invaluable asset of Vietnamese history and culture in general, and of the history and culture of Thang Long - Hanoi in particular. As of December 2009, in a total excavation area of ​​33,000 square meters, archaeologists have initially identified 168 relics including: 95 traces of architectural foundations, 16 relics of boundary wall foundations, 24 wells. water and 33 sewers. Besides architectural vestiges, there are traces of ponds, lakes, and streams, especially a river dug in the Early Le Dynasty with wooden boats, oars, and red-painted rudders. Remains of the lotus lake of the Forbidden City were also identified through the remains of leaves and lotus roots in the mud layer of the lake. That is the image of harmonious cohesion in urban planning, creating the environmental landscape of ancient Thang Long. The relic site has revealed millions of relics, of which a large number are architectural materials, ceramics and metal objects. Many artifacts are belongings of the Emperor and the Royal Family, associated with Imperial life and bearing the influence of Buddhism and Confucianism. Many ceramic artifacts have very diverse origins, not only produced by Vietnamese people but also purchased from China, Japan and West Asia. This shows that in Thang Long - Hanoi, cultural exchange and interference have taken place on a fairly wide scale. Although the complex of architectural foundation vestiges discovered at 18 Hoang Dieu is no longer intact, it is authentic and has very high scientific value, along with millions of relics discovered, reflecting the connection between the two buildings. The continuity of the long historical process of thousands of years of a center of power, demonstrating the cultural interference and integration with countries in East Asia and Southeast Asia of Thang Long - Hanoi, creating Dai Viet culture is imbued with national identity.
vi: Khu di tích khảo cổ học 18 Hoàng Diệu nằm cách nền điện Kính Thiên khoảng 100m về phía Tây, trong chỉnh thể thống nhất của di sản Khu Trung tâm Hoàng thành Thăng Long - Hà Nội. Từ tháng 12/2002, cuộc khai quật khảo cổ học lớn nhất Việt Nam đã được thực hiện tại 18 Hoàng Diệu. Khu khai quật khảo cổ học được Viện khảo cổ học phân làm 4 khu, đặt tên là A, B, C, D. Những khám phá quan trọng của khảo cổ học dưới lòng đất khu vực phía Tây trục trung tâm Cấm thành tại 18 Hoàng Diệu đã làm phát lộ một quần thể di tích kiến trúc phong phú, đa dạng cùng hàng triệu di vật thuộc nhiều thời kỳ nằm chồng xếp, đan xen nhau, bắt đầu từ thời Đại La (thế kỷ 7- 9), thời Đinh, Tiền Lê (thế kỷ 10), thời Lý (1009-1225), Trần (1226-1400), Lê sơ (1428-1527), Mạc (1527- 1592), Lê Trung Hưng (1593- 1789) và Nguyễn (1802- 1945). Lớp dưới cùng là hệ thống kiến trúc thuộc thời Tiền Thăng Long hay còn gọi là thời An Nam đô hộ phủ hoặc Đại La, thể hiện rõ qua hệ thong các cột gỗ, các nền móng kiến trúc, đường cống tiêu thoát nước, giếng nước và di vật như gạch “Giang Tây quân”, ngồi đầu ngói ống trang trí hình thú thần, mặt hề và nhiều đồ gốm sứ có niên đại thế kỉ 7 – 9. Lớp trên kiến trúc thời Đại La là dấu vết kiến trúc thời Lý – Trần, biểu hiện rõ qua hệ thống mặt bằng kiến trúc có các trụ móng sỏi kê chân cột, các lớp nền gạch, chân tảng đá hoa sen, sân gạch, đường cống thoát nước, đặc biệt là các loại hình di vật trang trí tên mái kiến trúc có kích thước to lớn và được trang trí cầu kì, tinh xảo. Một số vị trí có dấu tích văn hóa thời Đinh – Tiền Lê. Phía trên cùng là lớp kiến trúc thời Lê, với dấu tích của các nền kiến trúc xây bằng gạch vồ, hệ thống giếng nước, đặc biệt là các loại ngói thanh lưu ly, hoàng lưu ly trang trí rồng 5 móng chuyên dùng để lợp trên mái cung điện của nhà vua và các loại đồ sứ ngự dụng dành riêng cho nhà vua. Một số vị trí có dấu tích văn hoá thời Nguyễn nhưng mờ nhạt không rõ ràng. Những lớp đất mang dấu ấn của đủ hết các thời kì lịch sử trong vòng 1300 năm qua, lại có diễn biến theo trật tự và liên tục không gián đoạn, đặc biệt là có vị trí ở trung tâm của Hoàng Thành và Cấm Thành Thăng Long. Khu vực này là một tài sản vô giá của lịch sử và văn hóa Việt Nam nói chung, và của lịch sử – văn hóa Thăng Long – Hà Nội nói riêng Tính đến tháng 12/2009, trong tổng diện tích khai quật 33.000m2, các nhà khảo cổ học đã bước đầu xác định được 168 di tích bao gồm: 95 dấu tích nền móng kiến trúc, 16 di tích móng tường bao, 24 giếng nước và 33 cống nước. Bên cạnh dấu tích kiến trúc là các dấu tích ao hồ, dòng chảy, đặc biệt là con sông đào thời Lê sơ cùng thuyền gỗ, mái chèo, bánh lái được sơn son. Dấu tích hồ sen của Cấm thành cũng được xác định qua các tàn tích lá, củ sen trong lớp bùn của hồ nước. Đó là hình ảnh về sự gắn kết hài hòa trong quy hoạch đô thị, tạo dựng cảnh quan môi trường của Thăng Long xưa. Khu di tích đã phát lộ hàng triệu di vật, trong đó chiếm số lượng lớn là vật liệu kiến trúc, đồ gốm sứ và đồ kim loại. Nhiều hiện vật là đồ dùng của Hoàng đế và Hoàng gia, gắn với đời sống Hoàng cung và mang ảnh hưởng của Phật giáo, Nho giáo. Nhiều hiện vật gốm sứ có nguồn gốc rất đa dạng, không chỉ do người Việt Nam sản xuất mà còn được mua về từ Trung Hoa, Nhật Bản và Tây Á. Điều này cho thấy tại Thăng Long - Hà Nội sự trao đổi, giao thoa văn hóa đã diễn ra trên phạm vi khá rộng. Quần thể dấu tích nền móng kiến trúc phát hiện được tại 18 Hoàng Diệu cho dù không còn nguyên vẹn, nhưng mang tính xác thực và có giá trị khoa học rất cao, cùng với hàng triệu di vật được phát hiện đã phản ánh tính liên tục của quá trình lịch sử lâu dài hàng nghìn năm của một trung tâm quyền lực, minh chứng cho sự giao thoa và hội nhập văn hóa với các nước trong khu vực Đông Á, Đông Nam Á của Thăng Long- Hà Nội, tạo ra nền văn hóa Đại Việt mang đậm bản sắc dân tộc.

# d671
source: D67 Revolutionary House
vi: Nhà D67

# d672
source: House D67, whose full name is the Meeting Room of the Politburo and Central Military Commission. In 1966, the US began using air force to attack the capital Hanoi. In 1967, the level of raiding became increasingly fierce. To ensure the headquarters' workplace during the war, the Ministry of National Defense decided to build a house in Area A, Command Headquarters, Ministry of National Defense (Hanoi Citadel Palace during the Nguyen Dynasty). The house was designed and built in 1967, called house D67.Historical and revolutionary relic House D67 is associated with the activities of the Politburo, the Central Military Commission of the Communist Party of Vietnam (from 1976 onwards, the Vietnam Labor Party), the Minister of National Defense, and the General Staff of the School. Vietnam People's Army since September 1968. House D67 is a basic element of the General Headquarters in the resistance war against the US to save the country. In the relics of House D67, there are meeting rooms of the Politburo and Central Military Commission: Office of General Vo Nguyen Giap and Office of General Van Tien Dung. House D67 is one of the few military structures during the resistance war against the US that is still relatively intact. The main reason is because the project is built with sustainable materials: iron, steel, bricks, sand, cement. When damage occurs, the project is repaired promptly, on the other hand, the project is located in the construction area. Confidential area, carefully protected. On the outside, House D67 is a normal flat-roof house, size: 43.02 x 20.85m, roof top height 7.89m, located under a grove of trees. Only when inside does the military element appear clearly, the walls are 0.6m thick, soundproof, the door has 2 layers: the outer layer is made of 1cm thick steel plate. On the roof there is a layer of sand, which prevents rocket fragments and common bomb fragments. The back hallway is open with two doors to the underground bunker. The hatch is made of sheet steel. The meeting room of the Politburo and the Central Military Commission has 4 doors: the office of General Vo Nguyen Giap and General Van Tien Dung has 2 doors. When an incident occurs, you can quickly escape or go underground. There is no audio, video recording or anti-intrusion system inside. Tunnel D67 (Central Military Commission bunker) was built in 1967 along with building D67. The tunnel is 9m deep, solidly built to resist bombs. The tunnel has three flights of stairs up and down. The southern staircase connects to the Dragon House, and the two northern staircases connect to House D67. This is the meeting place of the Politburo and the Central Military Commission when necessary and is an important part of the structure of building D67. House D67 is a simple military structure but has very high use value. For 7 years, the house ensured safety for the Supreme Marshal's Ministry to work, plan policies, and direct the organization to successfully carry out the final phase of the resistance war against the US and save the country. House D67 is one of the precious military and cultural relics of the Ho Chi Minh era in the 20th century.'
vi: Nhà D67 mà tên đầy đủ là Phòng họp của Bộ Chính trị và Quân ủy Trung ương.Năm 1966, Mỹ bắt đầu dùng không quân đánh phá Thủ đô Hà Nội. năm 1967, mức độ đánh phá ngày càng ác liệt. Để đảm bảo nơi làm việc của cơ quan Tổng hành dinh trong chiến tranh, Bộ Quốc phòng quyết định xây dựng một ngôi nhà trong khu A, Sở chỉ huy, Bộ Quốc phòng (Hành cung thành Hà Nội thời Nguyễn). Ngôi nhà thiết kế và xây dựng vào năm 1967, được gọi là nhà D67. Di tích lịch sử – cách mạng Nhà D67 gắn với hoạt động của Bộ Chính trị, Quân ủy Trung ương Đảng Cộng sản Việt Nam (năm 1976 về trước là Đảng Lao động Việt Nam), Bộ trưởng Bộ Quốc phòng, Tổng Tham mưu trường Quân đội Nhân dân Việt Nam từ tháng 9 năm 1968. Nhà D67 là một thành tố cơ bản của Tổng hành dinh trong cuộc kháng chiến chống Mỹ, cứu nước. Trong di tích Nhà D67 có Phòng họp của Bộ Chính trị và Quân ủy Trung ương: Phòng làm việc của Đại tướng Võ Nguyên Giáp và Phòng làm việc của Đại tướng Văn Tiến Dũng. Nhà D67 là một trong những công trình kiến trúc quân sự ít ỏi trong kháng chiến chống Mỹ còn tương đối nguyên vẹn. Nguyên nhân chính là do công trình được xây dựng bằng vật liệu bền vững: sắt, thép, gạch, cát, xi măng, khi có hiện tượng hư hỏng, công trình được sửa chữa kịp thời, mặt khác, công trình nằm trong khu vực nghiêm mật, được bảo vệ chu đáo. Nhìn bề ngoài Nhà D67 là một ngôi nhà mái bằng bình thường, kích thước: 43,02 x 20,85m, chiều cao đỉnh mái 7,89m, nằm dưới lùm cây. Chỉ khi vào bên trong, yếu tố quân sự mới hiện rõ, tường dày 0,6m, cách âm, cửa có 2 lớp: lớp ngoài bằng thép tấm dày 1cm. Trên mái có 1 lớp cát, cản được mảnh rốc két và mảnh bom thong thường. Hành lang sau thong với hai cửa xuống hầm ngầm. Cửa hầm làm bằng thép tấm. Phòng họp của Bộ Chính trị và Quân ủy Trung ương có 4 cửa: phòng làm việc của Đại tướng Võ Nguyên Giáp, Đại tướng Văn Tiến Dũng vó 2 cửa. Khi xảy ra sự cố, có thể nhanh chóng thoát ra ngoài hoặc xuống hầm ngầm. Bên trong không có hệ thống ghi âm, ghi hình, chống đột nhập. Hầm D67 (hầm Quân ủy Trung ương) được xây dựng năm 1967 cùng với nhà D67. Hầm sâu 9m, được xây dựng kiên cố để chống bom. Hầm có ba tầng cầu thang lên xuống. Cầu thang phía nam thông với Nhà con rồng, hai cầu thang phía Bắc thông với nhà D67. Đây là nơi họp của Bộ Chính trị và Quân ủy Trung ương khi cần thiết và là phần quan trọng trong kết cấu nhà D67 Nhà D67 là một công trình kiến trúc quân sự giản dị nhưng giá trị sử dụng rất cao. Trong 7 năm, ngôi nhà bảo đảm an toàn cho Bộ Thống soái tối cao làm việc, hoạch định chủ trương, chỉ đạo tôt chức thực hiện thắng lợi giai đoạn cuối cùng của cuộc kháng chiến chống Mỹ, cứu nước. Nhà D67 một trong các di tích văn hóa quân sự quí giá thời đại Hồ Chí Minh ở thế kỉ 20.

# hauLau1
source: Hau Lau
vi: Hậu Lâu

# hauLau2
source: Hau Lau is about 2,392m2 wide, formerly known as Tinh Bac Lau, built after the Later Le dynasty, as the living and living place of the queen and princess. During the Nguyen Dynasty, Hau Lau was the residence of the royal concubines and beautiful women who accompanied the king on every trip to Bac Ha. The building is built of brick, box-shaped below, and above is a three-storey structure. The lower floor has three roof floors, the upper floor has two roof floors. The roof is adapted from the traditional Vietnamese architecture of a match-stacked roof, with knife-edges, but the entire roof is a brick and concrete structure, covered with imitation tiles on the outside. The French call Hau Lau the Princess's Floor or Pagode des Dames (Ladies' Pagoda). At the end of the 19th century, Hau Lau was seriously damaged. Later, the French renovated and rebuilt it to its present form.In 1998, with the consent of the Ministry of Culture and Information, the Institute of Archeology coordinated with the Hanoi Scenic Landscape Management Board to organize two archaeological excavations in two holes at Hau Lau relics. With the excavated architectural traces, it can be said that for the first time in the history of Thang Long - Hanoi research, along with the archaeological dig in Doan Mon, researchers have found traces of the foundation. of many architectures, many historical periods with different characteristics. This area is not far from Kinh Thien Palace and according to old history, is where many palaces and palaces of the royal court were located. Thus, it can be confirmed once again that Hau Lau is located in the central area of ​​Thang Long Imperial Citadel during the Ly - Tran - Le dynasties.
vi: Hậu Lâu rộng khoảng 2.392m2, xưa gọi là Tĩnh Bắc Lâu, được xây dựng từ sau đời Hậu Lê, là nơi ở và sinh hoạt của hoàng hậu và công chúa. Thời Nguyễn, Hậu Lâu làm nơi ở của các cung tần, mỹ nữ đi theo nhà vua mỗi chuyến công du Bắc Hà. Công trình được xây bằng gạch, phía dưới hình hộp, trên là công trình kiến trúc ba tầng. Lầu dưới có ba tầng mái, lầu trên là hai tầng mái. Phần mái phỏng theo kiến trúc cổ truyền Việt Nam kiểu mái chồng diêm, có các đầu đao nhưng toàn bộ mái là kết cấu gạch và bê tông, trên đắp ngoài giả ngói. Người Pháp gọi Hậu Lâu là Lầu Công chúa hay Pagode des Dames (Chùa các bà). Cuối thế kỉ 19, Hậu Lâu bị hư hỏng nặng, sau này người Pháp đã cải tạo xây dựng lại như hiện nay Năm 1998, được sự đồng ý của Bộ Văn hóa – Thông tin, Viện Khảo cổ học phối hợp cùng Ban quản lý danh thắng Hà Nội tổ chức 2 đợt khai quật khảo cổ học trên 2 hố tại di tích Hậu Lâu. Với các vết tích kiến trúc khai quật được, có thể nói lần đầu tiên trong lịch sử nghiên cứu Thăng Long – Hà Nội, cùng với cuộc đào thăm dò khảo cổ ở Đoạn Môn, các nhà nghiên cứu đã tìm thấy vết tích nền móng của nhiều kiến trúc, nhiều thời kì lịch sử với đặc trưng khác nhau. Khu vực này cách điện Kính Thiên không xa và theo sử cũ, là nơi có nhiều cung điện, lầu gác của triều đình. Như vậy có thể khẳng định một lần nữa Hậu Lâu nằm trong khu vực trung tâm của Hoàng Thành Thăng Long thời Lý – Trần – Lê.
